Documents/ЗаявкаНаРасходованиеСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ЗаявкаНаРасходованиеСредств</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапСогласования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭтапыСогласованияЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Утвердил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПланируемойОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УтвержденнаяДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУтверждения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетДляОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЭтапыСогласованияЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ЭтапыСогласованияЗаявок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МогутВидетьВсеЗаявки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТекущийЭтап</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭтапыСогласованияЗаявки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПоследующийЭтап</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭтапыСогласованияЗаявки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦФО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИсторияСогласованияЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ИсторияСогласованияЗаявок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаУтверждения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Утвердил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтапСогласования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭтапыСогласованияЗаявки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийСписаниеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыОперацийСписаниеДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПокупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратКредита</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗаймаКонтрагенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводНаДругойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятиеНаличных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеПодотчетномуЛицу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеЗП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеЗаработнойПлатыРаботнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеСотрудникуПоДоговоруПодряда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеДепонентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеДивидендов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗаймаРаботнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеСредстваПредпринимателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееСписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомиссияБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеНалогаЗаТретьихЛиц</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЭтапыСогласованияЗаявки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ЭтапыСогласованияЗаявки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛинейныйРуководитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФинКонтроль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФинДиректор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаявкаНаРасходованиеСредств/Forms/ФормаДокументаУправляемая/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПлатежноеПоручениеНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
		
	Если НЕ ЗначениеЗаполнено(Параметры.Ключ) ИЛИ Модифицированность Тогда
		ОбъектЗаписан = Записать();
		
		Если НЕ ОбъектЗаписан Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(ПлатежноеПоручение) Тогда
		ПоказатьЗначение(, ПлатежноеПоручение);
	Иначе//Если НЕ ТолькоПросмотр Тогда
		Если Объект.ПометкаУдаления Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Нельзя вводить платежку на основании документа, помеченного на удаление!'"));
			Возврат;
		КонецЕсли;
		
		ПараметрыСписания = Новый Структура("Основание", Параметры.Ключ);
		ОткрытьФорму("Документ.ПлатежноеПоручение.Форма.ФормаДокумента", ПараметрыСписания, ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СтатусПриИзмененииНаСервере()
	Объект.ДатаУтверждения  = ТекущаяДата();
	Объект.Утвердил = ПараметрыСеанса.ТекущийПользователь;	
КонецПроцедуры

&НаСервере
Функция ДоступныеЭтапы(ТекущийЭтап)
	текПользователь = ПараметрыСеанса.ТекущийПользователь;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭтапыСогласованияЗаявок.ПоследующийЭтап КАК ПоследующийЭтап
	|ИЗ
	|	РегистрСведений.ЭтапыСогласованияЗаявок КАК ЭтапыСогласованияЗаявок
	|ГДЕ
	|	ЭтапыСогласованияЗаявок.Пользователь = &Пользователь
	|	И ЭтапыСогласованияЗаявок.ТекущийЭтап = &ТекущийЭтап
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭтапыСогласованияЗаявок.ПоследующийЭтап";
	
	Запрос.УстановитьПараметр("Пользователь", текПользователь);
	Запрос.УстановитьПараметр("ТекущийЭтап", ТекущийЭтап);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ДоступныеЭтапы = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДоступныеЭтапы.Добавить(ВыборкаДетальныеЗаписи.ПоследующийЭтап);
	КонецЦикла;
	
	Возврат ДоступныеЭтапы;
КонецФункции

&НаСервере
Функция ТекДоступКЭтапу(ТекущийЭтап)
	текПользователь = ПараметрыСеанса.ТекущийПользователь;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭтапыСогласованияЗаявок.ТекущийЭтап КАК ТекущийЭтап
	|ИЗ
	|	РегистрСведений.ЭтапыСогласованияЗаявок КАК ЭтапыСогласованияЗаявок
	|ГДЕ
	|	ЭтапыСогласованияЗаявок.Пользователь = &Пользователь
	|	И ЭтапыСогласованияЗаявок.ТекущийЭтап = &ТекущийЭтап
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭтапыСогласованияЗаявок.ТекущийЭтап";
	
	Запрос.УстановитьПараметр("Пользователь", текПользователь);
	Запрос.УстановитьПараметр("ТекущийЭтап", ТекущийЭтап);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;;
	
КонецФункции


&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	СтатусПриИзмененииНаСервере();
	Элементы.Примечание.ТолькоПросмотр = Ложь;
	Объект.Примечание ="";
КонецПроцедуры


&НаКлиенте
Процедура СтатусНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	Элементы.Статус.СписокВыбора.Очистить();	
	СписокСтатусов = ДоступныеЭтапы(Объект.ЭтапСогласования);
	Элементы.Статус.СписокВыбора.ЗагрузитьЗначения(СписокСтатусов);
КонецПроцедуры


&НаКлиенте
Процедура История(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заявка",  Объект.Ссылка);
	ОткрытьФорму("РегистрСведений.ИсторияСогласованияЗаявок.Форма.ФормаПросмотра",ПараметрыФормы,,Объект);	
КонецПроцедуры


&НаСервере
Процедура ВвестиПлатежноеПоручениеНаСервере(ДанныеФормы)
	ЗаполнитьЗначенияСвойств(ДанныеФормы,Объект.Ссылка);
	ПроцентНДС = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(ДанныеФормы.СтавкаНДС);
	ДанныеФормы.видОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику;
	ДанныеФормы.СуммаНДС   = Окр(ДанныеФормы.СуммаДокумента * ПроцентНДС / (100 + ПроцентНДС), 2);
	ДанныеФормы.ИННПолучателя               = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеФормы.Контрагент, "ИНН");
	ДанныеФормы.Дата = ТекущаяДата();
	ВалютаРегламентированногоУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();	
	РеквизитыДоговораСтрока = "ВалютаВзаиморасчетов, РасчетыВУсловныхЕдиницах, УчетАгентскогоНДС";
	Если ЗначениеЗаполнено(ДанныеФормы.ДоговорКонтрагента) Тогда
		ДанныеДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеФормы.ДоговорКонтрагента, РеквизитыДоговораСтрока);
	Иначе
		ДанныеДоговора = Новый Структура(РеквизитыДоговораСтрока, ВалютаРегламентированногоУчета, Ложь, Ложь);
	КонецЕсли;
	
	ВалютаВзаиморасчетов        = ДанныеДоговора.ВалютаВзаиморасчетов;
	Если ЗначениеЗаполнено(ДанныеФормы.ДоговорКонтрагента) Тогда
		ВалютаДокумента     = ВалютаВзаиморасчетов;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ВвестиПлатежноеПоручение(Команда)
	
	Форма = ПолучитьФорму("Документ.ПлатежноеПоручение.Форма.ФормаДокумента");
	ДанныеФормы = Форма.Объект;
	
	ВвестиПлатежноеПоручениеНаСервере(ДанныеФормы);
	КопироватьДанныеФормы(ДанныеФормы, Форма.Объект);
	
	Форма.Открыть();
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		Объект.ЭтапСогласования = Перечисления.ЭтапыСогласованияЗаявки.Новая;
	Иначе
	
		ЭтаФорма.ТолькоПросмотр = не ТекДоступКЭтапу(Объект.ЭтапСогласования);
	КонецЕсли;

	Если Объект.ЭтапСогласования = Перечисления.ЭтапыСогласованияЗаявки.Новая Тогда 
		Если   Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь Тогда 
			ЭтаФорма.ТолькоПросмотр = ложь;
		КонецЕсли;
	КонецЕсли;
	
	
	Если Объект.ЭтапСогласования =  Перечисления.ЭтапыСогласованияЗаявки.ФинДиректор Тогда 
		Элементы.ПлатежноеПоручениеНадпись.Доступность = Истина;
	КонецЕсли;
	
	Если Объект.ЭтапСогласования =  Перечисления.ЭтапыСогласованияЗаявки.ФинДиректор или  
		Объект.ЭтапСогласования =  Перечисления.ЭтапыСогласованияЗаявки.ФинКонтроль  Тогда 
		Элементы.УтвержденнаяДатаОплаты.Доступность = Истина;
	КонецЕсли;
	
	ПоказатьПП();
    	
КонецПроцедуры


&НаКлиенте
Процедура ДатаПланируемойОплатыПриИзменении(Элемент)
	Если Параметры.Ключ.Пустая() Тогда
		Объект.УтвержденнаяДатаОплаты = Объект.ДатаПланируемойОплаты;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда 
	Объект.ВалютаДокумента = ВернутьВалютуВзаиморасчетов(Объект.ДоговорКонтрагента);
	ЗаполнитьСчет();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСчет()
	Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента.БанковскийСчетДляОплаты) Тогда 
		Объект.БанковскийСчетДляОплаты = Объект.ДоговорКонтрагента.БанковскийСчетДляОплаты;
	Иначе 
		Объект.БанковскийСчетДляОплаты = Объект.Контрагент.ОсновнойБанковскийСчет;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ВернутьВалютуВзаиморасчетов(ДоговорКонтрагента)
	Возврат	ДоговорКонтрагента.ВалютаВзаиморасчетов;
КонецФункции

&НаСервере
Процедура ПоказатьПП()
ПлатежноеПоручение = НайтиПП();
	
	Если ЗначениеЗаполнено(ПлатежноеПоручение) Тогда 
		ПараметрыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПлатежноеПоручение, "Номер, Дата");
		СтрокаДокумент = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ПараметрыДокумента.Номер, Истина, Ложь);
		
		ПлатежноеПоручениеНадпись =СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Платежное поручение № %1 от %2'"),
			СтрокаДокумент,
			Формат(ПараметрыДокумента.Дата, "ДФ=dd.MM.yyyy"));

	Иначе 
		ПлатежноеПоручениеНадпись = "Ввести платежное поручение";
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция НайтиПП()
	ПП = Документы.ПлатежноеПоручение.ПустаяСсылка();
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДокументСсылка", Объект.Ссылка);
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ДокСписания.Ссылка
		|ИЗ
		|	Документ.ПлатежноеПоручение КАК ДокСписания
		|ГДЕ
		|	ДокСписания.ДокументОснование = &ДокументСсылка";
		
		ВыборкаИзЗапроса = Запрос.Выполнить().Выбрать();
		
		Если ВыборкаИзЗапроса.Следующий() Тогда
			ПП = ВыборкаИзЗапроса.Ссылка;
		КонецЕсли;
	Возврат ПП;	
КонецФункции

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПоказатьПП();
КонецПроцедуры
